
{"posts":[{"title":"How to know a girl likes you","subPostDatas":[{"title":"The First sign is staring","content":"The first sign of whether a girl likes you is staring. If a girl has an interest in you she will surely make or steal a stare.","titlecolor":false},{"title":"You will be a great personality to her","content":"She will always give great values for your concepts and attitude. She gives a special interest to know your plans and ideas. She always loves to discuss your aspects and future plans.","titlecolor":false},{"title":"Notice her response when you are in front of her","content":"If she becomes nervous or expresses a bright face you can take it as a positive thing. If she is with her friends there will be a sudden reaction between them. This shows that there will be a discussion about you and her among them.","titlecolor":false},{"title":"You will be a great personality to her","content":"She will always give great values for your concepts and attitude. Gives a special interest to know your plans and ideas. She always loves to discuss on your aspects and your future plans.","titlecolor":false},{"title":"Ignorance makes her jealous","content":"When you ignore her by talking to other girls you can notice she is jealous and becomes a bit mad at you. If you mention to you that you are attracted to some other girl, then she will stop talking to you. This is the best sign for how to know a girl likes you.","titlecolor":false},{"title":"She always reminds you about her relationship status","content":"She will always make it clear that her status is single. She will try to mention to you that she is ready to date a guy or she needs a partner. She will always ask you to join her.","titlecolor":false},{"title":"Submits complaints to you","content":"She will share all her troubles and problems she faces with you. She also makes complaints to you about her close related one, especially about parents who always scold her.","titlecolor":false},{"title":"She will try to learn about your past love","content":"She always wants to know about whether you are engaged or details about your exes. She will try to disclose the maximum from you.","titlecolor":false},{"title":"Tries to touch you","content":"She makes excuses to touch you and feel your sensation. She will try to hold your hands, in situations made by her.","titlecolor":false}]},{"title":"How to attract a girl for love","subPostDatas":[{"title":"","content":"So there\u0027s that girl you\u0027ve been crushing on, but you don\u0027t know how to get her attention? Never fear! While there\u0027s no fool-proof way to attract a girl, there are some things you can do to make it more likely that you\u0027ll claim her attention. Build your confidence, learn what to say to her, and how to act around her and you\u0027ll be attracting a girl in no time!","titlecolor":false},{"title":"Build your confidence.","content":"Confidence is one of those qualities that girls find attractive. Now, confidence doesn\u0027t equal arrogance, so there\u0027s a fine line that you\u0027ll need to walk. Fortunately, you can build your confidence, it\u0027s not something that you\u0027re just born with.\nFake confidence until you actually start to feel confident. You can do this by doing confident things, even if you don\u0027t feel it. Start small and work your way up. For example: if you\u0027re shy, strike up conversation with one person you don\u0027t know each day. Work your way up to striking up conversation with that cute girl you\u0027ve been eying.\nUse confident body postures to convey confidence and trick yourself into being confident. Stand with your legs apart and your hands on your hips. Don\u0027t cross your arms across your chest (this comes across as being not confident).\nChew gum. Weirdly, not only does chewing gum make your breath smell nice (which can be attractive to a girl), but it can actually reduce your stress. So before you\u0027re around the girl you\u0027re looking to attract, pop a stick of gum in your mouth.","titlecolor":false},{"title":"Practice good hygiene","content":"The definition of hygiene very much depends on where in the world you are. Certain places have higher or lower standards of hygiene and you\u0027ll be more likely to attract a girl with more or less cleanliness. (For example: if you lived in rural Alaska, you would probably attract a girl with less cleanliness than Los Angeles.)\nBathe at least once a week. This is, obviously, just a guideline, but it\u0027s a good idea to clean yourself at least occasionally. While there is research that supports women finding men\u0027s sweat attractive, you don\u0027t want to overwhelm her with your sweat.\nKeep your clothes laundered. Again, a little sweat and a little scent isn\u0027t a bad thing, but you want your clothes to be at least moderately clean.","titlecolor":false},{"title":"Make sure your teeth are clean","content":"White teeth are definitely a sign of attractiveness. More than your physical features a girl is likely to be attracted to clean, white, healthy teeth, so make sure that you\u0027re brushing twice a day, at least, and flossing regularly.\nWhite teeth are one of the first things women (or anyone) will notice, so it\u0027s important that you take good care of them.\nYou also want your breath to smell good, which means brushing your tongue, as well, especially at the back of your mouth.","titlecolor":false},{"title":"Use your clothes to enhance","content":"Clothes can be an important indicator of confidence, and of attractiveness. Again, it really depends on where you are in terms of your main wardrobe (what goes over well and is necessary in rural Alaska is going to be very different from what is necessary and stylish in Los Angeles). There are a few basic things to keep in mind, however.\nMake sure your jeans, or whatever trousers you\u0027re wearing, fit you. Clothes that fit can enhance your body. Baggy clothing hides your body, or makes you look sloppy, while too-tight clothing looks good on basically no one.\nBuy nice shoes. While not all girls are obsessed with shoes (or clothes) a good pair of shoes can make you look put together, which is something a girl will register, whether she does it subconsciously or not.\nPick colors that work with your skin tone, eye color, and facial features. If you have a nice pair of green eyes, wear a forest green sweater that makes them pop. Red and black are very good colors to wear if you\u0027re looking to attract. Both red and black make you appear more powerful.","titlecolor":false},{"title":"Dont overwhelm with perfume","content":"There\u0027s nothing wrong with a little scent, especially if you live somewhere that is big on colognes and body spray. But you want to make sure that you don\u0027t overwhelm the girl you\u0027re looking to attract. You may also want to consider not covering up your natural scent. Women tend to be attracted to a man\u0027s sweat.[5]\nJust make sure that you aren\u0027t overwhelming anyone with your body odor. It\u0027s a good balance that you have to strike. If you\u0027re of the type who sweats a lot, make sure that you wash frequently and change your shirts.\nCologne and body spray can add a nice little accent to your appearance as long as you don\u0027t go overboard. Spritz a little behind your ear, on your face and chin (one spritz should do it) and on your chest. You want to make sure that your cologne or body spray mingles with your natural scent and pheromones","titlecolor":false},{"title":"Find your passion","content":"People are attracted to those who know who they are, are confident about that, and who have passion about something. Passion about things (like sports, or rock climbing, cooking, or writing) can translate into passion for another person, which is an attractive quality.\nHaving things that you\u0027re passionate about gives you something to talk about. It\u0027s one reason why nerds are big right now, because nerds aren\u0027t afraid to be passionate about the things that they like.\nFigure out what it is that you enjoy. This means giving lots of different things a try and pursuing the things that you love. Don\u0027t be afraid to screw up or not be good at something when you first start out (very few people can make a flan on the first try, for example). Being able to make mistakes without letting it upset your equilibrium is an attractive quality.","titlecolor":false},{"title":"Cultivate the art of listening","content":"Listening, real listening, is a lost art. People are so busy wanting to talk about themselves, or checking their phone, that they have a tendency not to really listen. If you show that you care what other people have to say, you\u0027ll show that you\u0027re a good bet as a partner.\nWhen someone is talking to you, make sure that you give them your full attention. Make eye contact, avoid checking your phone. If you don\u0027t feel comfortable making eye contact, try and look over one of their shoulders, or at their forehead, because it will look like you\u0027re making eye contact, without actually having to do that.\nListen to all people, even girls you dont find attractive. This shows that you respect people and that you think all people are important and you\u0027re not just listening to someone because you want to get into her pants. Unless she\u0027s only looking for a one-night stand, a girl doesn\u0027t want to feel like you\u0027re only paying attention to her because you want to have sex with her.","titlecolor":false},{"title":"Approach her with respect.","content":"Always approach a girl with the underlying realization that she is, first and foremost, a human being and thus is worthy of respect (it doesn\u0027t matter what she\u0027s wearing, how drunk she is, or how she\u0027s acting). Girls are often taught that they don\u0027t deserve respect, so you\u0027ll stand out from a lot of other guys.\nMake sure that you have respect for yourself, too. This is about confidence. When you talk to or approach a girl, don\u0027t base your happiness on whether she\u0027s going to be interested in you. When you make it seem like you\u0027re desperate. Politely engage her in conversation and if she doesn\u0027t seem interested, back off.\nBe respectful to other people when you\u0027re around her (this ties in with treating people well). Avoid degrading women, whether it\u0027s by telling a rape joke (just don\u0027t), calling other guys \"pussies\" or using words like \"that bitch\" to talk about your ex-girlfriend. You\u0027ll come across as disrespectful and immature.\nA lot of guys mix up being confident with being arrogant and awful. They say that women only want horrible guys who treat them poorly. The thing about this type of guy is that he exudes confidence. It tends to be the confidence rather than the crappy behavior that girls are attracted to.","titlecolor":false},{"title":"Ask her questions about herself","content":"Make it seem like you\u0027re actually interested in what she has to say. Instead of jumping right in with something about yourself, follow up with another question about what she just said. Girls, like anyone else, like to think that people are interested in their thoughts and opinions.\nFor example: you might ask her about her job and when she tells you she\u0027s working as a barista, ask her how she likes it, what\u0027s her favorite part about the job, what\u0027s her least favorite part.\nObviously make sure that you listen to what she says. Don\u0027t just be formulating your next question, or it\u0027ll seem like you\u0027re interrogating her without caring about the answers.\nDont get too personal too quickly. If you\u0027ve only just met the girl, don\u0027t jump right in asking about her relationship with her family, or whether she has any deep dark secrets (although asking this as a joke might be okay depending on the girl). if the two of you end up dating, there\u0027ll be time for that later.","titlecolor":false},{"title":"Be playful","content":"You don\u0027t have to have a big shit-eating grin when you\u0027re hanging out with her, but it\u0027s a good idea to make your interactions fun. She\u0027ll remember that being around you was fun and kind of charged (flirting is good for that).\nRather than a big open smile, consider having a kind of half-smile. This is often more attractive to girls than full-on grinning.\nMake her laugh. Tell funny stories. Real ones are the best ones, especially ones where you come off as human. It shows that you can laugh at yourself. For example: you might tell her about the time you tried to scare your dad when he was coming out of the gym locker room, only to scare a completely random person.\nBe careful with humor, because not everyone has the same type of humor. Make sure that you\u0027re gauging your reaction. Is she laughing hard at what you\u0027re saying, or only laughing politely. Avoid harmful humor, as well, such as racist or sexist jokes.","titlecolor":false},{"title":"Flirt with a girl.","content":"Flirting can be a bit hit or miss, but it\u0027s a great way to create a fun, light atmosphere. It can also get a bit charged and leave her wanting more. Make sure you go by each individual girl\u0027s reaction, because every girl is different in what she likes and dislikes.\nTease her gently. Don\u0027t be mean about what you say, but gently poke fun at her. For example: tell her that you can out-dance her on the dance. If she is a better dancer, pretend that you are, instead.\nEye contact is an extremely important part of flirting. Keep eye contact with the girl that you\u0027re interested in, across the bar, while you\u0027re in conversation. It\u0027ll build a real charge of energy between the two of you","titlecolor":false}]},{"title":"How to give a gift to girlfriend","subPostDatas":[{"title":"","content":"You will be able to buy a lots and lots of gifts, but still there will be a perfect gift for your girlfriend.  A gift can represent your feelings. Its the interpretation of how much you know her. Everyone wants his gift remembered by his girlfriend for a life time. Whenever she receives gift she should remember the special gift given by you. To make this all happen you have to keep some things in mind before you buy a gift. Try to know answers for these questions, which would help you to know her.\n\nWhat kind of music she loves?\nWhat is her favorite color?\nWhat kind of dress she wears?\nWhat she does in her free times?\nWhat kind of food she eats?","titlecolor":false},{"title":"Selecting a gift","content":"To select a gift there are different perspectives. You can give her a needful gift or a beautiful gift. Most of the boys need to buy a gift which is needful as well as beautiful. Most of such items comes in electronic gift items such a i Pods, Mobile, Laptops. If you are going for high end versions you can go for scooters and cars. Most of this kind of gifts has no selection problem. On getting into small gifts you will be confused more. For this you have to keep in mind the answers of above questions. To have a difference the most appropriate thing is something handmade by you or with the help of others. Such things will remain unique. Glass paintings or writings with your personal happenings or the things happening between you two will be a good one to cherish. If you come to know your girl more close you will be having lots of suggestions by yourself. You can approach her friends or parents to know her tastes. One thing equally important is how you give her the gift. Try to make it a surprise. Or give it in a romantic way. Gifting is the art of making a girl think of you. So just go ahead and make her think soon.","titlecolor":false}]},{"title":"Benefits of kissing Reasons for kissing your lover","subPostDatas":[{"title":"","content":"I have discussed a lot of things about kiss in the previous post. But I dont explained much about benefits of kissing. I just mentioned one thing that kissing makes the relationship strong, but there is a lot of scientifically proved things on kissing. First of all dont thing kissing is a process of contact of lips. There is so many health related things on it. So let me point on some benefits.","titlecolor":false},{"title":"","content":" A passionate kiss will stimulate the hormone oxytocin known as love hormone. This hormone makes the couple keep a close relationship and loved by each other.\n        Our face is composed of 29 facial muscles, while kissing we will get a exercise for these facial muscles. This will prevent the wrinkle and increase the blood circulation, this keeps us younger .\n                While kissing exchange of minerals,fats and proteins takes place. This helps to create antibodies to fight against some disease. Thus kissing increases our immunity and keep us more healthy.","titlecolor":false},{"title":"","content":"A french kiss burns 5 calories and a normal romantic kiss burns 2 to 3 calories. So if you kiss more it will helps to burn calories.\nThe sensitivity you gives through lips is 200 times more than you do with fingers.\nA deep or passionate kiss which makes a duration of 90 minutes increases blood pressure,heart beat and level of hormones. This will add one minute life.\nKissing decreases the cortisol hormone known as stress hormone. It also increases the level of serotonin in brain. This will helps to lower the stress and anxiety which gives the effect of meditation.\nIt increase the endorphins level. This improves our mood and feels happy.\nOur saliva contains an anesthetic, so it will helps to reduce pain. Its also releases dopamine and makes pleasure.","titlecolor":false}]},{"title":"How to say I Love You in creative ways","subPostDatas":[{"title":"","content":"I know that moment, when trying to propose a girl. How to propose a girl?\n\nAll of you knows that most common three words in the world. The three words which we mostly use to propose or mention our love to a girl or boy. “I LOVE YOU” this is the key to start a relationship mixed with love. Most of the couple start their love with this three words.","titlecolor":false},{"title":"","content":"Every one can say these three words many times without any reason, but if you are in love and you are going to say these words to your crush, then it will be a difficult task for you to say that words. Saying, I love you to a girl or boy looking directly to his or her face always makes your proposal successful.","titlecolor":false},{"title":"","content":"If you can do it in a different style with a surprise or a creative way, it will be more sexy and awesome. So I am doing a favor for all who thinks like that. Let me share some ways to say “I love you” to your crush.\n","titlecolor":false},{"title":"I love you","content":"Heart is a symbol of love. So make hundreds of hearts out of colored or gilt paper and shower over her, then say you loves her.\nSpread rose petals in front of her gate before she wakes up in the morning.  Give a call and ask her to go in front of the gate, then tell her that this is the symbol of intense love on you.\nSketch a picture of her and drop it in a secret place. You should write on the picture that “This is the angel who comes in my mind at every night and make me restless and make me to say- “I love you”.\nWrite her name on your chest and take a snap and sent it to her. Then say like this, I think this is the right place to write your name and right name to write here.\nWrite “I Love you” on your cars bonnet and brake in front of her.\nLight numerous lamps in a private place or in a pond at night and invite her to the location and say your love to her.","titlecolor":false},{"title":"","content":"Give an anonymous proposal through email or any kind of source and give a suspense to her and disclose your identity within two or three days.\nSpent a day with her and make her happy and comfort as much you can finally give her touching good bye. Text a SMS  at late night saying “I LOVE YOU”.\n Gift her a doll or any other attractive and romantic stuff with an hidden “I love you message“.  After two or three days tell about the hidden message, let her search and read it and know your mind.\nGift her a bunch of gas filled red balloons written her name with white letters and open your mind romantically.\n Write the love you message including her name in three places where she usually visits or passes. Tell her that its was done by you after two days.\nDesign a T-shirt with letters mentioning your love with her name. Wear it inside a black jacket and open in front her in proposal position.\nInvite her for a candle light dinner and put your proposal ring in glass filled with red wine. Give the red wine to her, when she finishes it she will see the ring with a surprise, at that time you say your love to her.\n","titlecolor":false},{"title":"","content":"So this very few one which I got from my life itself. I am searching for more from others including my readers, so I am ready to update with your methods also. So this page will updated at any time. So now onwards dont  get confused for “How to say I love you for the first time”.","titlecolor":false}]},{"title":"How to make Out with a girl \u0026 Make it hot","subPostDatas":[{"title":"","content":"Are you terrified about make out with a girl for the first time? Use this guidelines or tips on how to make out and you will experience like a player! A first is always something that pressures a guy a lot. Its a whole new encounter and you just do not know how your new partner would respond to you. So if you are pressured to much you may end up creating a deceive out of yourself. So be relaxed and act awesome. So if you are concerned do not be study this tips and be assured.","titlecolor":false},{"title":"","content":"It makes no difference if you are making out for first time or the hundredth time just keep it simple. You need to keep in mind that a kiss is just a small sector of making out. There are so much more to do. You have a whole body that is streaming with full sex-related confidence. So why restrict it just to the lips?","titlecolor":false},{"title":"The perfect place","content":"If you want to have a fun time making out, you both should be relaxed with your environment. Discover a place where you can have your comfort without any disruptions if you want to prevent disruptions and develop the relationship with your environment. Discover a position where you can have your comfort without any disruptions if you want to prevent disruptions and develop the relationship.","titlecolor":false},{"title":"","content":"Dont give a much hope for the mood. The nature you both experience at this time performs a big aspect to making out. Just be yourself, and take it easy too much about how you are going to make out. When when comes you will be instantly prepared.","titlecolor":false},{"title":"Avoid a sudden kiss","content":"when the experience is right, you can hug your “partner” as soon as you experience it. But if you are still anxious about the kiss, keep that believed. Pushing a hug on your new girlfriend too soon may make factors uncomfortable for both of you, especially if you are not prepared for it.\n\nInstead, shift your experience really near to your second halfs experience as you sit next to them. You can rub your nasal area against their experience or even hug their experience really near to their mouth. Or if you want to take it more slowly, position your hand along the returning of their throat, shift in near and gently hug the throat right under the chin area or the ear, and just take in into the hug.\n\nTake your time, and do not try to hurry in at any factor. Just appreciate when. Enjoy the moment. Close your eyes and enjoy the sensation as you run your hands all over your partner. Breath in to their skin, enjoy the way you feel each other. Wrap your arms around them and run in along the length of their back. Enjoy the sexual intensity as you both feel each other.","titlecolor":false},{"title":"Stimulate the erogenous areas","content":"You can hug your girl at any point of time, when you feel like it. But every few minutes, take a break from the the kiss and enjoy the rest of your lovers whole body. Without splitting the delicate moment, shift your mouth away from their mouth. Slowly and amorously, continue the kiss them around their lips, their neck or their ear lobes. Bring your experience away from their experience, and without splitting the flow, hug their shoulder area, shift on and chew their hands carefully and eventually carry their fingertips to your mouth. Kiss their fingertips and run your mouth over their fingertips, while moving your hands all over their whole body. Every little part of the whole body that stays out like the nasal area, hearing, fingertips, feet, legs, hands is a potential erogenous area that is just shouting for your touch when you create out with someone. Run your hands and mouth all over their whole body, and youll definitely arouse your partner and create them want to burst in sexual summit!","titlecolor":false},{"title":"Making your kiss perfect","content":"One aspect you need to know about the kiss is that its just like having hands and interlacing convenience with your  boyfriend or girlfriend. Its really simple, is not it? But just to keep each others hands, both of you have to move your convenience absolutely while handling with each other to make sure your convenience interlace absolutely. A hug works the same way.\n\nFactor your go a little bit it  ll help you take in more easily, element the oral cavity area just a little and place the oral cavity area properly against your second halfs oral cavity and kiss them. Do not move the oral cavity area a lot at least for the first few a few minutes so you can appreciate the sensation without any worry of what you need to do next.","titlecolor":false}]},{"title":"9 Ways to Make Your Girlfriend Happy","subPostDatas":[{"title":"Surprise her with memorable gifts.","content":"Make sure you never forget your girlfriends special occasions, however trivial they may seem to you. And every now and then, show just how much you love her by giving her a memorable gift of love, be it a bling thing or a priceless gift like a heartfelt letter of love","titlecolor":false},{"title":"Respect her opinions.","content":"As humans, respect plays a big part in how we feel about ourselves. When we feel disrespected by someone important to us, we feel miserable. And this holds the same effect in relationships too. Dont dismiss your girlfriends opinions and ideas without listening to her, and dont take her lightly just because *shes a girl*. In a relationship, both partners have to learn to listen to each other and respect each others point of view.","titlecolor":false},{"title":"Compromise for her.","content":"Every now and then, compromise your wants for her needs. If she wants to watch a romantic movie while you want to watch something else, give in to her now and then. When she sees how youre willing to give up something you like just to please her, itll only make her feel more loved and happy.","titlecolor":false},{"title":"Cuddle up with her at home.","content":"Do you end up getting turned on each time you hug your girlfriend or kiss her for a few minutes? Thats understandable. But at least once a day, hug her tight and cuddle with her while watching the telly or when both of you are lying in bed. For a girl, a few hugs and sweet kisses feel just as special as a good round of passionate sex","titlecolor":false},{"title":"Make her laugh.","content":"Humor has a very important place in relationships. Even when both of you dont have anything to talk about, a few funny lines or gestures can make the whole day feel like such a fun activity. ","titlecolor":false},{"title":"Make her feel secure","content":"If you want to make your girlfriend feel happy in the relationship, you need to focus on the one thing girls want most in a guy, his protective streak. When your girl feels secure when youre around, and when she feels like she can depend on you for anything, shed instinctively feel happier to be in love with you. ","titlecolor":false},{"title":"Let her know youre lucky to have her.","content":"Did you have to woo your girl for a while before she finally accepted to date you? Always let her know that you still love her just as much as you did when both of you first started dating. And more than anything else, let her know that you have never taken her for granted and never will. If you feel lucky to date such a wonderful girl, remind her about it all the time. ","titlecolor":false},{"title":"Call her unexpectedly and sweet talk her","content":"Love shouldnt always be predictable, especially when its a happy surprise. Drop by at her place or at her office out of the blue with flowers or a small gift. Call her up when she least expects your call and remind her about how much you miss holding her in your hands right at that moment. In love, if its a happy feeling, share it. It makes all the difference between a happy romance and a bored one","titlecolor":false},{"title":"Make big promises and keep them","content":"Do you promise things to your girlfriend? Do you make little assurances about planning a surprise birthday party or about the future? Make promises all the time, but make sure you fulfill them even if it takes years to do so. Nothing feels more special to a girl than to know that her boyfriend is a man of his word. It makes her feel more secure, and most importantly, it makes her feel happy to be in love with you.","titlecolor":false}]},{"title":"List of Cute Names to Call Your Girlfriend","subPostDatas":[{"title":"Tips for choosing cute names to call your girlfriend","content":"Make sure that your girlfriend approves of the nickname that you keep for her and is not irked by it.\n\nYou can derive a cute nickname for her from her real name, for example Sandra can be called Sandy. \n\nMake sure that you give her a nickname in accordance to the time you have spent together, for example, you should not call her wifey if your relationship is just two months old. \n\nAvoid calling her with a sexual nickname in public such as Hot stuff. \n\nAvoid picking names from TV shows and books. Giving her a nickname from a TV show will not make her feel special.","titlecolor":false},{"title":"List of Cute Names to Call Your Girlfriend","content":"Doll- If she is as perfect as a doll in your eyes. \nQueen- If she is the queen of your heart.\nJuliet- If she is the heroine to your tale. \nDaisy- If she is delicate like a flower. \nHappiness- If she is the reason of your happiness. \nKitten- If she is adorable like a kitten. \nBoo- If you find her sexy. \nButton- If she is cute as a button. \nAngel- If you believe she is your guardian angel. \nMagic- If she makes your life magical. \nPink- If she is girly. \nDonut- For someone who is sweet and round. \nCuddles- As you love to cuddle with her. \nSummer- As she brings light and brightness to your life. \nBub- For someone who is too adorable. \nGorgeous- This one is self-explanatory. \nLover-Girl –As she is the one you truly love. \nWifey- Someone you plan to make your future wife. \nHoney- A classic rolls on the tongue. \nCinderella- As she is a princess in your eyes. \nHot-stuff- If she is irresistible. \nPretty lady- If she is gentle and delicate. \nSunshine- If she lights up your day. \nSweet-heart- If she is sweet and sincere. \nPrecious- If you consider her too valuable to lose. \nHot Mama – If you find her curvy and sexy. \nBright eyes- If her eyes are her best feature. \nCookie- If she is sweet as a cookie. \nLove- If you feel nothing but love when you see her. \nMy All- If she means everything to you. \nLucky charm- If you believe that she brings you good luck. \nCutie-pie- If you find her cute and sweet. \nDarling- As she is the dearest. \nDream-girl- As she is the girl of your dreams. \nLamb- If she is as adorable as a sweet little lamb. \nCupcake- If she is sweet and yummy. \nSpring- If she adds color to your life.\nLemon- If she adds something new and exciting to your life. \nPooh- If she is as loveable as Winnie the Pooh. \nRose- If she is as precious as a rose. \nHop- If she is fun-loving. \nJoy- If she brings you joy. \nMelody- If her voice is as melodious as a melody. \nSprinkles- She is colorful, fun and happy. \nCherry- She completes your life. \nBabe- If she is sexy. \nSnuggly- For someone you love to snuggle with. \nPumpkin- As she is bright and sweet. \nDove- As she is fragile and pure. \nPeach- If you consider her cute and delightful.","titlecolor":false}]},{"title":"101 Reasons why I Love You","subPostDatas":[{"title":"","content":"\nI love his eyes.\nI love his smile.\nI love the way he laughs.\nI love moments when we can finish each others sentences.\nI love it when he holds my hand.\nI love it when we look into each others eyes and the rest of the world disappears.\nI love it when he looks at me, talks about me and touches me as if every part of me is precious.\nI love the fact that we dream of a grand adventure together.\nI love the fact that he values my opinion.\nI love it when he kisses me on my forehead; it is the deepest feeling of love and peace.\nI love the fact that though we have tough times together, he still chooses to be with me.\nI love that he loves taking stolen pictures of me.\nI still look beautiful in his eyes no matter how bad I think I look.\nI love when he said hed still love me even I get SO FAT!\nI love that he gets jealous with other guys.\nI love that I am his reason why he wake up so early.\nI am myself when I am with him.\nI dont need to clean the house before he comes over.\nI can tell him every little thing about me.\nI can ask him a dumb question without feeling dumb.\nI love the fact that when Im around him, I can be myself and not worry about what he may think of me because I know he loves me for who I am.\nHe is very patient even when Im yelling.\nHe is overflowing with confidence.\nHe can handle adversity and come out stronger.\nHe is Intelligent.\nI feel so secured and loved when he hugs me tight.\nHe still calls me beautiful even if I have pimples and no make-up on.\nHes incredibly sentimental and romantic.\nHe truly makes me feel beautiful inside and out.\nHe loves the food that I cook.\nHe tells me that he will always protect and love me, and I know he mean it. Hell ALWAYS do!\nHe has a huge heart.\nHe makes me feel that my heart has finally found a home.\nHe is Handsome and I never get tired of looking at him.\nHe keeps his promises.\nHe gets a long with my family and friends easily.\nHe admits when he is wrong and says sorry EVENTUALLY.\nHe is OVERLY PROTECTIVE.\nHe is such a gentleman.\nHe is good at forgiving me for occasional stupidity.\nWhen I punch him he pretends to be hurt to be kissed.\nHe still loves me even with all my faults.\nHes NEVER boring.\nWe both know that together we can work out anything.\nHe never says “Are you going to tell that story AGAIN?\nWe can talk about everything and nothing—it always okay with him.\nHe is my inspiration.\nHe knows how to make me smile.\nHe never leaves me behind.\nWe can talk over the phone for hours even if weve just seen each other a couple of hours ago.\nHe is so dependable and trustworthy.\nWhen Im with him, nothing else seems to matter.\nHearing his voice chases away all the blues.\nWhen he is around everything is fun and boring when hes not.\nWe both really cant do without each other.\nThinking of him adds a wonderful touch of love to my every day.\nEvery moment I spent with him is one filled with laughter.\nHis love gives me the feeling that the best is still ahead.\nHe never gave up on me and thats what keeps me going.\nHe is as helpful as a therapy, but he never charges me for it. HAHA :))\nHes simply irresistible.\nHis terrific sense of humor.\nHe brings out the best in me.\nHe never gets mad at me even I slapped him many times on the face because of laughing so hard. \u003d))))\nHes a good sport even when Im not.\nHe loves cuddling.\nHe can read my innermost thoughts.\nI love his idea of fun—laughing really hard and playing practical jokes :))\nHe always says what I need to hear.\nHe is someone I can goofy with ANYTIME and ANYWHERE \u003d))))\nHe makes my days BETTER\nHe tells me that He loves me so much. MILLION TIMES A DAY :\u003e\nHe laughs at my jokes even when they are not funny.\nHe got many tickles in the body. BWAHAHAHA!\nHes planning his future with me.\nHe gave me back rubs.\nHe cares so much about me.\nHe wants to grow old with me.\nI love his SMELL.\nI love it when he just walked out of our house he sends me messages that says “iloveyousomuch and “imissyoualready.\nWhen we are fighting he always try to make us stop.\nI love it how open weve become with each other.\nHe loves playing with kids.\nHe doesnt have any vices.\nHe wants whats best for me.\nHe listens to my random stories that really have no point. HAHA!\nHe always says that He wants to be with me FOREVER.\nWe spent the Christmas and New Year together.\nHe ALWAYS gives me TIME.\nHe is FULL OF EFFORT.\nHe accepts and loves my imperfections.\nWe are pretty much INSEPARABLE.\nHe doesnt act differently around his friends.\nWe talk about dumbest stuff we made and laugh about it. \u003d)))\nWere crazy about each other.\nHe sings me love songs even though he is not good at it. \u003d))))\nI love it when he said that he wants to build OUR HOUSE HIMSEELF. :\u003e\nHe loves me more than life itself.\nI love the looks on his face when he is being naughty.\nI love his instant GOOSEBUMPS. WAHAHA!\nI love him so much because HE IS STILL THE SAME GUY AFTER ALL THIS TIME. :\u003e\n","titlecolor":false}]}]}