{
  "posts": [
    {
      
      "title": "101 Reasons why I Love You",
      "subPostDatas": [
        {
          "title": "",
          "content": "I love his eyes.\nI love his smile.\nI love the way he laughs.\nI love moments when we can finish each others sentences.\nI love it when he holds my hand.\nI love it when we look into each others eyes and the rest of the world disappears.\nI love it when he looks at me, talks about me and touches me as if every part of me is precious.\nI love the fact that we dream of a grand adventure together.\nI love the fact that he values my opinion.\nI love it when he kisses me on my forehead; it is the deepest feeling of love and peace.\nI love the fact that though we have tough times together, he still chooses to be with me.\nI love that he loves taking stolen pictures of me.\nI still look beautiful in his eyes no matter how bad I think I look.\nI love when he said hed still love me even I get SO FAT!\nI love that he gets jealous with other guys.\nI love that I am his reason why he wake up so early.\nI am myself when I am with him.\nI dont need to clean the house before he comes over.\nI can tell him every little thing about me.\nI can ask him a dumb question without feeling dumb.\nI love the fact that when Im around him, I can be myself and not worry about what he may think of me because I know he loves me for who I am.\nHe is very patient even when Im yelling.\nHe is overflowing with confidence.\nHe can handle adversity and come out stronger.\nHe is Intelligent.\nI feel so secured and loved when he hugs me tight.\nHe still calls me beautiful even if I have pimples and no make-up on.\nHes incredibly sentimental and romantic.\nHe truly makes me feel beautiful inside and out.\nHe loves the food that I cook.\nHe tells me that he will always protect and love me, and I know he mean it. Hell ALWAYS do!\n",
          "titlecolor": false
        },
        {
          "title": "",
          "content": "He has a huge heart.\nHe makes me feel that my heart has finally found a home.\nHe is Handsome and I never get tired of looking at him.\nHe keeps his promises.\nHe gets a long with my family and friends easily.\nHe admits when he is wrong and says sorry EVENTUALLY.\nHe is OVERLY PROTECTIVE.\nHe is such a gentleman.\nHe is good at forgiving me for occasional stupidity.\nWhen I punch him he pretends to be hurt to be kissed.\nHe still loves me even with all my faults.\nHes NEVER boring.\nWe both know that together we can work out anything.\nHe never says “Are you going to tell that story AGAIN?\nWe can talk about everything and nothing—it always okay with him.\nHe is my inspiration.\nHe knows how to make me smile.\nHe never leaves me behind.\nWe can talk over the phone for hours even if weve just seen each other a couple of hours ago.\nHe is so dependable and trustworthy.\nWhen Im with him, nothing else seems to matter.\nHearing his voice chases away all the blues.\nWhen he is around everything is fun and boring when hes not.\nWe both really cant do without each other.\nThinking of him adds a wonderful touch of love to my every day.\nEvery moment I spent with him is one filled with laughter.\nHis love gives me the feeling that the best is still ahead.\nHe never gave up on me and thats what keeps me going.\nHe is as helpful as a therapy, but he never charges me for it. HAHA :))\nHes simply irresistible.\nHis terrific sense of humor.\nHe brings out the best in me.\nHe never gets mad at me even I slapped him many times on the face because of laughing so hard. \u003d))))\n",
          "titlecolor": false
        },
        {
          "title": "",
          "content": "Hes a good sport even when Im not.\nHe loves cuddling.\nHe can read my innermost thoughts.\nI love his idea of fun—laughing really hard and playing practical jokes :))\nHe always says what I need to hear.\nHe is someone I can goofy with ANYTIME and ANYWHERE \u003d))))\nHe makes my days BETTER\nHe tells me that He loves me so much. MILLION TIMES A DAY :\u003e\nHe laughs at my jokes even when they are not funny.\nHe got many tickles in the body. BWAHAHAHA!\nHes planning his future with me.\nHe gave me back rubs.\nHe cares so much about me.\nHe wants to grow old with me.\nI love his SMELL.\nI love it when he just walked out of our house he sends me messages that says “iloveyousomuch and “imissyoualready.\nWhen we are fighting he always try to make us stop.\nI love it how open weve become with each other.\nHe loves playing with kids.\nHe doesnt have any vices.\nHe wants whats best for me.\nHe listens to my random stories that really have no point. HAHA!\nHe always says that He wants to be with me FOREVER.\nWe spent the Christmas and New Year together.\nHe ALWAYS gives me TIME.\nHe is FULL OF EFFORT.\nHe accepts and loves my imperfections.\nWe are pretty much INSEPARABLE.\nHe doesnt act differently around his friends.\nWe talk about dumbest stuff we made and laugh about it. \u003d)))\nWere crazy about each other.\nHe sings me love songs even though he is not good at it. \u003d))))\nI love it when he said that he wants to build OUR HOUSE HIMSEELF. :\u003e\nHe loves me more than life itself.\nI love the looks on his face when he is being naughty.\nI love his instant GOOSEBUMPS. WAHAHA!\nI love him so much because HE IS STILL THE SAME GUY AFTER ALL THIS TIME. ",
          "titlecolor": false
        }
      ]
    }
  ]
}